In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.5.3'

In [3]:
data = {

    "names":['a','b','c'],

    "ages":[25,28,21]

}

In [4]:
df=pd.DataFrame(data)

In [6]:
df.head(2)
df.tail(3)

  names  ages
0     a    25
1     b    28
2     c    21

In [7]:
df.describe()

            ages
count   3.000000
mean   24.666667
std     3.511885
min    21.000000
25%    23.000000
50%    25.000000
75%    26.500000
max    28.000000

In [9]:
df.dtypes

names    object
ages      int64
dtype: object

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   names   3 non-null      object
 1   ages    3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [11]:
df.columns=["emp_name","age"]

In [12]:
df

  emp_name  age
0        a   25
1        b   28
2        c   21

In [13]:
df2=df.rename(columns={"emp_name":"fname","age":"age"})

In [14]:
df2

  fname  age
0     a   25
1     b   28
2     c   21

In [16]:
dept=["Sales","Marketing","IT"]
df2=df.assign(Company=dept)

In [18]:
df2.dtypes

emp_name    object
age          int64
Company     object
dtype: object

In [19]:
df3=df2.convert_dtypes()
df3.dtypes

emp_name    string
age          Int64
Company     string
dtype: object

In [20]:
df4=df2.astype({"age":float})

In [21]:
df4.dtypes

emp_name     object
age         float64
Company      object
dtype: object

In [24]:
df4.count()

emp_name    3
age         3
Company     3
dtype: int64

In [29]:

technologies = {

    'Courses':["Spark","PySpark","Hadoop","Python","pandas"],

    'Fee' :[20000,25000,26000,22000,24000],

    'Duration':['30day','40days','35days','40days','60days'],

    'Discount':[1000,2300,1200,2500,2000]

              }

In [28]:
df4.shape

(3, 3)

In [30]:
df=pd.DataFrame(technologies)
df

   Courses    Fee Duration  Discount
0    Spark  20000    30day      1000
1  PySpark  25000   40days      2300
2   Hadoop  26000   35days      1200
3   Python  22000   40days      2500
4   pandas  24000   60days      2000

In [31]:
label=['r1','r2','r3','r4','r5']

In [32]:
df=pd.DataFrame(technologies,index=label)
df

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200
r4   Python  22000   40days      2500
r5   pandas  24000   60days      2000

In [36]:
df.loc['r1']

Courses     Spark
Fee         20000
Duration    30day
Discount     1000
Name: r1, dtype: object

In [38]:
df.loc[['r1','r2']]

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300

In [39]:
df.loc['r1':'r3']

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200

In [40]:
df.loc[df["Fee"]>=22000]

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200
r4   Python  22000   40days      2500
r5   pandas  24000   60days      2000

In [41]:
df.query('Courses=="PySpark"')

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300

In [42]:
df.query('Courses!="PySpark"')

   Courses    Fee Duration  Discount
r1   Spark  20000    30day      1000
r3  Hadoop  26000   35days      1200
r4  Python  22000   40days      2500
r5  pandas  24000   60days      2000

In [48]:
df=df.drop(['Discount'],axis=1)

In [51]:
emp=pd.read_csv("emp.csv")

In [52]:
emp

   id    name  age gender
0   1      Om   22      F
1   2  Prerna   24      F
2   3     Sod   45      M
3   4    Prak   55      F

In [68]:
df=pd.read_csv("employee.csv")

In [69]:
df.shape

(1000, 8)

In [70]:
df.info

<bound method DataFrame.info of     First Name  Gender  Start Date Last Login Time  Salary  Bonus %  \
0      Douglas    Male    8/6/1993        12:42 PM   97308    6.945
1       Thomas    Male   3/31/1996         6:53 AM   61933    4.170
2        Maria  Female   4/23/1993        11:17 AM  130590   11.858
3        Jerry    Male    3/4/2005         1:00 PM  138705    9.340
4        Larry    Male   1/24/1998         4:47 PM  101004    1.389
..         ...     ...         ...             ...     ...      ...
995      Henry     NaN  11/23/2014         6:09 AM  132483   16.655
996    Phillip    Male   1/31/1984         6:30 AM   42392   19.675
997    Russell    Male   5/20/2013        12:39 PM   96914    1.421
998      Larry    Male   4/20/2013         4:45 PM   60500   11.985
999     Albert    Male   5/15/2012         6:24 PM  129949   10.169

    Senior Management                  Team
0                True             Marketing
1                True                   NaN
2               False               Finance
3                True               Finance
4                True       Client Services
..                ...                   ...
995             False          Distribution
996             False               Finance
997             False               Product
998             False  Business Development
999              True                 Sales

[1000 rows x 8 columns]>

In [71]:
df.describe()

              Salary      Bonus %
count    1000.000000  1000.000000
mean    90662.181000    10.207555
std     32923.693342     5.528481
min     35013.000000     1.015000
25%     62613.000000     5.401750
50%     90428.000000     9.838500
75%    118740.250000    14.838000
max    149908.000000    19.944000

In [72]:
df.dtypes

First Name            object
Gender                object
Start Date            object
Last Login Time       object
Salary                 int64
Bonus %              float64
Senior Management     object
Team                  object
dtype: object

In [62]:
df=df.convert_dtypes()

In [73]:
df.dtypes

First Name            object
Gender                object
Start Date            object
Last Login Time       object
Salary                 int64
Bonus %              float64
Senior Management     object
Team                  object
dtype: object

In [74]:
df['Start Date'] = pd.to_datetime(df['Start Date'])

 

print(df.info())

 

print(df.nunique())

 

print(df.isnull())

 

print(df.isnull().sum())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: datetime64[ns](1), float64(1), int64(1), object(5)
memory usage: 62.6+ KB
None
First Name           200
Gender                 2
Start Date           972
Last Login Time      720
Salary               995
Bonus %              971
Senior Management      2
Team                  10
dtype: int64
     First Name  Gender  Start Date  Last Login Time  Salary  Bonus %  \
0         False   False       False            False   False    False
1         False   False       False            False   False    False
2         False   False       False            False   False    False
3         False   False       False            False   False    False
4         False   False       False            False   False    False
..          ...     ...         ...              ...     ...      ...
995       False    True       False            False   False    False
996       False   False       False            False   False    False
997       False   False       False            False   False    False
998       False   False       False            False   False    False
999       False   False       False            False   False    False

     Senior Management   Team
0                False  False
1                False   True
2                False  False
3                False  False
4                False  False
..                 ...    ...
995              False  False
996              False  False
997              False  False
998              False  False
999              False  False

[1000 rows x 8 columns]
First Name            67
Gender               145
Start Date             0
Last Login Time        0
Salary                 0
Bonus %                0
Senior Management     67
Team                  43
dtype: int64

In [76]:
df['Gender'] = df['Gender'].fillna('No Gender')
df.isnull().sum()

First Name           67
Gender                0
Start Date            0
Last Login Time       0
Salary                0
Bonus %               0
Senior Management    67
Team                 43
dtype: int64

In [78]:
df.groupby(['Gender']).count()

 

df['Senior Management'] = df['Senior Management'].fillna(df['Senior Management'].mode())

 

df

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,No Gender,2014-11-23,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1984-01-31,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,12:39 PM,96914,1.421,False,Product
998,Larry,Male,2013-04-20,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,6:24 PM,129949,10.169,True,Sales